{"format": "graph-model", "generatedBy": "2.6.2", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"embedding_1_input": {"name": "embedding_1_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "15"}]}}}, "outputs": {"dense_7": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_6/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_6/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_7/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/maximum_iterations", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "Func/StatefulPartitionedCall/input/_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "400"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "Func/StatefulPartitionedCall/input/_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "embedding_1_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "15"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/Cast", "op": "Cast", "input": ["embedding_1_input"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential_1/embedding_1/Cast", "StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_1/embedding_1/embedding_lookup", "StatefulPartitionedCall/sequential_1/lstm_1/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Shape", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/Shape_1", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/transpose", "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice", "StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed/1"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}, "axis": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/Shape_1", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1/stack", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/packed", "StatefulPartitionedCall/sequential_1/lstm_1/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros/packed", "StatefulPartitionedCall/sequential_1/lstm_1/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_1/lstm_1/zeros_1", "^StatefulPartitionedCall/sequential_1/lstm_1/zeros", "^StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor"]}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_22", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros_1", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_20", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"T": {"type": "DT_VARIANT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_23", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_17", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/loop_counter", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_18", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/maximum_iterations", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_21", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/zeros", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_24", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_19", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/time", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_25", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_2", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "is_constant": {"b": true}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_26", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_3", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "is_constant": {"b": true}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_27", "op": "Enter", "input": ["Func/StatefulPartitionedCall/input/_4", "^StatefulPartitionedCall/sequential_1/lstm_1/while/LoopControlInputs/_28"], "attr": {"is_constant": {"b": true}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF8xL2xzdG1fMS93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_34", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_22", "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_61"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_32", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_20", "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_59"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_35", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_23", "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_62"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_29", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_17", "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_56"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_30", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_18", "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_57"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_33", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_21", "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_60"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_36", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_24", "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_63"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_31", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_19", "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_58"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/cond/_15/sequential_1/lstm_1/while/Less", "op": "Less", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_31", "StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_35", "^StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_36", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_25", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_26", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_27", "^StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_29", "^StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_30", "^StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_32", "^StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_33", "^StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_34"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopCond/_37", "op": "LoopCond", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/cond/_15/sequential_1/lstm_1/while/Less"]}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1_switch/_41", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_32", "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1_switch/_44", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_35", "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/while/loop_counter_switch/_38", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_29", "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/while/maximum_iterations_switch/_39", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_30", "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_45", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_36", "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/time_switch/_40", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_31", "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/zeros_switch/_42", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_33", "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/zeros_1_switch/_43", "op": "Switch", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/merge/_34", "StatefulPartitionedCall/sequential_1/lstm_1/while/LoopCond/_37"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/exit/_50", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1_switch/_41"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/exit/_53", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1_switch/_44"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/exit/_47", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/while/loop_counter_switch/_38"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/loop_body_control/_46", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/while/loop_counter_switch/_38:1"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/exit/_48", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/while/maximum_iterations_switch/_39"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/exit/_54", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_45"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/exit/_49", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/time_switch/_40"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/exit/_51", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/zeros_switch/_42"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/exit/_52", "op": "Exit", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/zeros_1_switch/_43"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2Stack/TensorListStack", "op": "TensorListStack", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/exit/_50", "StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2Stack/TensorListStack/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "num_elements": {"i": "-1"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_45", "^StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2_1_switch/_41", "^StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1_switch/_44", "^StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/time_switch/_40", "^StatefulPartitionedCall/sequential_1/lstm_1/while/loop_body_control/_46", "^StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/while/maximum_iterations_switch/_39", "^StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/zeros_1_switch/_43", "^StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/zeros_switch/_42", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_25", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_26", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_27"]}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayV2Stack/TensorListStack", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_1", "StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/add_1/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_25"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "100"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split_1-folded-3", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_26"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_25"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split_1-folded-1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_26"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_25"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split_1-folded-0", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_26"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/add/y", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input/_80", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/time_switch/_40:1", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_25"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split_1-folded-2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_26"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input/_82", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/zeros_switch/_42:1", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/strided_slice_3", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_27", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/strided_slice_1", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_27", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/strided_slice", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_27", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "100"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/strided_slice_2", "op": "Const", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_27", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "100"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/output_control_node/_100", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_25", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_26", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_27"]}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_25", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_26", "^StatefulPartitionedCall/sequential_1/lstm_1/while/enter/_27"], "attr": {"_acd_function_control_output": {"b": true}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_4/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_3", "StatefulPartitionedCall/sequential_1/dense_4/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_4/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/while/loop_counter_switch/_38:1", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/add_1/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/add", "op": "AddV2", "input": ["Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input/_80", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/add/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "op": "TensorListGetItem", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_45:1", "Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input/_80", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/MatMul_7", "op": "MatMul", "input": ["Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input/_82", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/strided_slice_3"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/MatMul_5", "op": "MatMul", "input": ["Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input/_82", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/strided_slice_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/MatMul_4", "op": "MatMul", "input": ["Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input/_82", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/strided_slice"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/MatMul_6", "op": "MatMul", "input": ["Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input/_82", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/strided_slice_2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_62", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/strided_slice_1_switch/_44:1", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/output_control_node/_100", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_63", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/TensorArrayUnstack/TensorListFromTensor_switch/_45:1", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/output_control_node/_100", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_57", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/while/maximum_iterations_switch/_39:1", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/output_control_node/_100", "^StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/NoOp", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/input_control_node/_77"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_4/Relu", "StatefulPartitionedCall/sequential_1/dense_5/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_5/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_56", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/add_1", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/output_control_node/_100", "^StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/next_iteration/_58", "op": "NextIteration", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/add", "^Func/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/output_control_node/_100", "^StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/NoOp"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/BiasAdd_3", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split-folded-3", "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split_1-folded-3"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/BiasAdd_1", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split-folded-1", "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split_1-folded-1"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split-folded-0", "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split_1-folded-0"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/BiasAdd_2", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/TensorArrayV2Read/TensorListGetItem", "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split-folded-2", "ConstantFolding/StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/split_1-folded-2"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_6/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_5/BiasAdd", "StatefulPartitionedCall/sequential_1/dense_6/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_6/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "transpose_a": {"b": false}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/BiasAdd_3", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/MatMul_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/BiasAdd_1", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/MatMul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/BiasAdd", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/MatMul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/BiasAdd_2", "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/MatMul_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_7/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_6/Relu", "StatefulPartitionedCall/sequential_1/dense_7/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/Sigmoid_2", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/add_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/Sigmoid_1", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_7/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_1/dense_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/mul_8", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/Sigmoid_1", "StatefulPartitionedCall/sequential_1/lstm_1/while/StatefulPartitionedCall/sequential_1/lstm_1/zeros_1_switch/_43:1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/mul_9", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_1/lstm_1/while/body/_16/sequential_1/lstm_1/while/lstm_cell/Sigmoid", 